//
//  FinalReferences.swift
//  Voyager
//
//  Created by admin on 29.11.2023.
//

import Foundation

struct FinalReference: PhraseDelegate {
    static let shared = FinalReference()
    private init() {}
    
    private let text0 = PhraseData(
        text: "Существует убеждение, которое гласит, что то, что должно случиться - должно случиться. С таким тезисом сложно спорить.",
        type: .common
    )
    
    private let text1 = PhraseData(
        text: "Тебя не спасла ни квартира, снятая без договора, ни одобренные маршруты для перемещений, ни случай, ни карма и не провидение, когда чёрный тканевый мешок опустился на твою голову. Спустя несколько перемещений и пиханий под рёбра мешок сняли – неожиданно, но ты был в борделе за городом, только в той его части, где могли оказаться только особые гости.",
        type: .common
    )
    
    private let text2 = PhraseData(
        text: "Вокруг было несколько людей в погонах в потрёпанном виде. Все сидели вокруг большого стола: кто-то ел, кто-то пил, кто-то увлечённо касался нанятых девушек. Один сел через весь стол напротив, начал вести речь.",
        type: .common
    )
    
    private let text3 = PhraseData(
        text: "- Ну ты маху дал однозначно, когда принял решение запускать деньги в акции крупных корпораций, пользуясь номерами, которые взяты под фальшивые документы. Если тебе продали симку, это ещё не значит, что всё шито-крыто. Мы теперь тут всё кроем и шьём для таких вот умельцев вроде тебя. Если честно, мне плевать, по каким сусекам ты скрёб, чтобы накопить эти суммы.",
        type: .interlocutor
    )
    
    private let text4 = PhraseData(
        text: "- Ты не кисни и не мрачней, в твоём деле не всё безнадёжно. Товарищ майор справедлив и совсем не жесток, так что он подготовил тебе способ выхода из грязных дел. Мы ведь выяснили, кто ты такой, а твои обвинения в вымогательстве уже истекли по сроку, так что ты можешь спокойно пересаживаться на старые документы, обычные, твои родные. Вот и они.",
        type: .interlocutor
    )
    
    private let text5 = PhraseData(
        text: "Он достал изпод стола прозрачный запечатанный пакет с паспортом и несколькими другими бумагами.",
        type: .common
    )
    
    private let text6 = PhraseData(
        text: "- Скажем так, мы окажем тебе услугу. Ты переоформишь, а точнее просто выдашь сведения по своим вкладам. Это всё перейдёт в наши руки, а взамен документы станут твоими. Все контакты шулеров ты нам тоже сливаешь, и вообще ты всех и всё сдаёшь с потрохами – про дела твои вокруг спорта мы тоже догадываемся. Или ты откажешься, пытать мы тебя не станем, документы ты не получишь, но зато тебе влепят за все прегрешения, связанные с использованием фальшивых бумаг. Что скажешь, друг? Выбор за тобой.",
        type: .interlocutor
    )
    
    private let text7 = PhraseData(
        text: "Жарковато было сидеть в окружении этих пьяных лбов, хотя это могло быть и связано с чем-то ещё. Двери были закрыты, окна тоже. Пакет с паспортом лежал на столе. Переговорщик улыбался и молча смотрел на тебя.",
        type: .common
    )
    
    private let text8 = PhraseData(
        text: "Одна из дверей отворилась, из неё одна за другой влетели стальные банки, выпускающие дымок. Пол секунды все смотрели на это, а ещё спустя мгновение ломанулись кто куда мог. Как бы кто ни дёргался, в итоге крепкий сон настиг каждого…",
        type: .common
    )
    
    private let text9 = PhraseData(
        text: "- Посмотрите-ка, кто очнулся.",
        type: .interlocutor
    )
    
    private let text10 = PhraseData(
        text: "Ты был всё на том же месте и в том же положении, что при разговоре с полицией. Самих полицейских не было нигде вокруг, на столе и полу виднелись редкие кровяные подтёки. В комнате находился только ты и незнакомец, который давил на тебя на переговорах, где ты был со спортсменом. Он был явно не в духе. Бутылки алкоголя были собраны в одну кучу, еда была нетронута. Незнакомец был вооружён серебристым револьвером с длинным дулом и ветвистой резьбой. По всей видимости, оружие было сделано на заказ.",
        type: .common
    )
    
    private let text11 = PhraseData(
        text: "- Тебе объяснять нужно популярно, или сам всё поймёшь?",
        type: .interlocutor
    )
    
    private let text12 = PhraseData(
        text: "-…",
        type: .mc
    )
    
    private let text13 = PhraseData(
        text: "- Мой контакт из их рядов сообщил, что ребята собираются раньше субботника, да ещё и с особым гостем. Эти парни въехали в тему по части работы с нелегальными документами. Им хотелось и насажать аферистов, и присвоить себе кучу денег. На деньги твои мне плевать, если честно, но вот первый пункт, это проблема… Они ведь не совсем идиоты - удалось им спалить цепочки, п которым я делал бумаги. Ты не первый, кто проплатил мне фальшак. Только ты не уехал из страны, как планировал, а остался и доигрался до акционных бумаг, сукин сын... ",
        type: .interlocutor
    )
    
    private let text14 = PhraseData(
        text: "- У меня и раньше случалось, что ребята из низов правоохранительной системы находят спалившихся с документами и ищут источник, только это было всего один раз, и тогда уже мне пришлось зачищать ведущих расследование надмозгов. Было грязно, но я принял решение сразу же, и это мне окупилось – проблем не возникло, и всё вновь пошло своим чередом. Я рубил бабло на схемах, мои клиенты с бумагами сливались в другие страны каждый по своим причинам.",
        type: .interlocutor
    )
    
    private let text15 = PhraseData(
        text: "- Но тут появился ты. Эх и удалось же тебе не сдохнуть от удара битой по голове. Видать, ты особо живучий, или просто особо везучий, или же и то, и другое. Ну а я, видать, запорол себе карму, когда кинул тебя на бабло, вот теперь меня и выявили повторно.",
        type: .interlocutor
    )
    
    private let text16 = PhraseData(
        text: "- Я сейчас избавился от четырёх легавых умельцев, четырёх. Местные мадмуазель меня в лицо не видели, так что их закапывать смысла нет. А ещё мне дёргаться смысла нет, потому что всё, что я назвал, уже пущено в ход: ребята решили тебе похвастаться о том, что уже почти сделано. За мной точно явятся, вопрос лишь когда и что будет со мной – экстрадируют такого элемента откуда угодно.",
        type: .interlocutor
    )
    
    private let text17 = PhraseData(
        text: "- У меня ведь всё на мази было, всё на потоке, мне уже не интересно вспоминать молодость и каждый винтик этого процесса проворачивать своими руками. Но суть в том, что единственный способ для меня затеряться – применить вообще навыки, что у меня есть, один за другим и в одиночку. Это может быть и поможет, но я вот не уверен, что хуже, оказаться на нарах, или бегать по притонам Тайланда.",
        type: .interlocutor
    )
    
    private let text18 = PhraseData(
        text: "- Да, я, конечно, растратил свой фарт. Из-за тебя, или же вообще – в былые времена мне давалось всё куда легче.",
        type: .interlocutor
    )
    
    private let text19 = PhraseData(
        text: "- Так что вот как мы с тобой поступим. Раз у нас всё опять свелось к воле случая, и всё дело в везении, дай-ка я запущу проверку на оставшуюся удачливость прямо сразу, прямо сейчас. Мы сыграем с тобой в рулетку. Побеждаешь ты – ты берёшь документы и валишь на все четыре, все грехи повесят на мой труп, это точно. Побеждаю я – ты умираешь, ментов вешают временно на тебя, а мне это даёт фору.",
        type: .interlocutor
    )
    
    private let text20 = PhraseData(
        text: "Ты смекнул, что, если играть откажешься, он в тебя просто выстрелит.",
        type: .common
    )
    
    private let text21 = PhraseData(
        text: "- Я согласен.",
        type: .mc
    )
    
    private let text22 = PhraseData(
        text: "- Отлично, мать твою! Накати сперва, а то духу не хватит спустить курок. Я набрался уже дальше некуда, только стресс такой, что всё равно не пьянею.",
        type: .interlocutor,
        answerPositive: "Согласиться пить",
        answerNegative: "Отказаться пить",
        hasAnswers: true
    )
    
    private let textDD = PhraseData(
        text: "Ты играешь на трезвую голову, нервничаешь. Берешь в руки револьвер, рука дрожит. Поднимаешь глаза на незнакомца и выстреливаешь в него. Из-за мандража выстрел идет мимо цели, незнакомец пробивает тебе бошку...",
        type: .common
    )
    
    private let text0n = PhraseData(
        text: "- Отличный выбор, ты высосал целую кружку. Я не говорил тебе, что оно демидрольное?",
        type: .interlocutor
    )
    
    private let text1n = PhraseData(
        text: "- Нееееет…",
        type: .mc
    )
    
    private let text2n = PhraseData(
        text: "Это был уже третий неестественный сон за сутки, башку ломило даже без сознания, а перед глазами мелькали образы всех последних месяцев, месяцев с тех пор, как ты терял память. Они выстроились в пёстрый калейдоскоп, который вращался и ломался до тех пор, пока картинка целиком не сложилась.",
        type: .common
    )
    
    private let text3n = PhraseData(
        text: "Это был разговор с дьяком, то есть с его молодой версией, вы были на каких-то занятиях.",
        type: .common
    )
    
    private let text4n = PhraseData(
        text: "- Значит, ты решил открыть свою секту?",
        type: .sportsman
    )
    
    private let text5n = PhraseData(
        text: "- Не особо свою. Это будет русифицированный, упрощённый вариант кришнаитства. Тема популярна по всему миру, люди несут деньги для того, чтобы гуру научили их, как прийти к встрече с создателем после смерти. С точки зрения нас, это полная… щебень, но пипл хавает, мне плевать, почему, если честно. Как известно, мы живём в богом забытой, так что тут особый дефицит божественно – может клюнет кто на идею пообщаться с всевышним посмертно.",
        type: .mc
    )
    
    private let text6n = PhraseData(
        text: "Это был разговор всё с ним же, но уже при иных обстоятельствах, в каком-то просторном зале.",
        type: .common
    )
    
    private let text7n = PhraseData(
        text: "- Помнишь девушку, которая учила все сутры? Она перестала посещать твои сессии.",
        type: .sportsman
    )
    
    private let text8n = PhraseData(
        text: "- Ничего страшного, людей мне хватает, а сборы уже начались.",
        type: .mc
    )
    
    private let text9n = PhraseData(
        text: "- А на что тебе все эти деньги?",
        type: .sportsman
    )
    
    private let text10n = PhraseData(
        text: "- Накоплю и свалю за бугор доживать в хороших условиях. А ни этого ли хотят все у нас?",
        type: .mc
    )
    
    private let text11n = PhraseData(
        text: "После этого воспоминания всплыл образ незнакомца. Вы стояли напротив друг дурга, у него был прозрачный пакет документов.",
        type: .common
    )
    
    private let text12n = PhraseData(
        text: "- Здесь всё, как и договаривались через сеть. Вижу, вы осуществили первый трансфер.",
        type: .interlocutor
    )
    
    private let text13n = PhraseData(
        text: "- Да, всё верно. Могу я получить бумаги?",
        type: .mc
    )
    
    private let text14n = PhraseData(
        text: "Он протянул пакет, ты бегло ознакомился.",
        type: .common
    )
    
    private let text15n = PhraseData(
        text: "- Хорошо. Если честно, мне удалось собрать всё ещё даже раньше, чем запланировано. Я могу сейчас отправить вторую часть, вы тогда организуете оставшееся со своей стороны?",
        type: .mc
    )
    
    private let text16n = PhraseData(
        text: "- Да, конечно, давайте…",
        type: .interlocutor
    )
    
    private let text17n = PhraseData(
        text: "Ты полез в телефон, начал свайпать экран.",
        type: .common
    )
    
    private let text18n = PhraseData(
        text: "- Всё готово.",
        type: .mc
    )
    
    private let text19n = PhraseData(
        text: "- Вижу… Вижу, что бабла у тебя выше крыши, дружок.",
        type: .interlocutor
    )
    
    private let text20n = PhraseData(
        text: "- Мы перешли на ты?",
        type: .mc
    )
    
    private let text21n = PhraseData(
        text: "- Ты решил обчищать людей на такие суммы, ты, что думаешь, что это так можно? У нас все солидные люди верующие, они строят церкви по всей стране для людей для простых. Почему, как ты думаешь, мы такие дела проворачиваем и не попадаемся? Потому что бог с нами, мы богоугодны, мы ко всем честным людям относимся по-людски, а ты просто сосёшь из них деньги! Ты ведь не удивишься, что, после стольких динамо ходов тебя самого просто кинут?",
        type: .interlocutor
    )
    
    private let text22n = PhraseData(
        text: "Из обратной стороны кожанки появилась короткая бита, и удар влетел ещё до того, как ты что-либо понял.",
        type: .common
    )
    
    private let text23n = PhraseData(
        text: "Вот и всё, от химла в крови мозги встали на место – в прошлой жизни ты был гуру-кидалой, который хотел накопить на сытую жизнь за бугром в тепле. Ты почти достиг цели, но твой способ заработка сыграл против тебя.",
        type: .common
    )
    
    private let text24n = PhraseData(
        text: "Не смотря на завершение просмотра воспоминаний, химной дурман по-прежнему не отпускал тебя. Это значило, что либо ты смотришь неприятный и долгий сон, либо… ты умер.",
        type: .common
    )
    
    private let text25n = PhraseData(
        text: "Переулок, где был незнакомец, лишился домов, дорожных столбов, птиц в небесах. Ты стоял на асфальте, уходящим за горизонт, как неожиданный порыв ветра ударил в лицо. Он был таким сильным, что ты не мог держать глаза открытыми и не мог сделать вздох. Когда ветер стих, ты взглянул вперёд и увидел перед собой его.",
        type: .common
    )
    
    private let text26n = PhraseData(
        text: "Это был высокий молодой человек с длинными волнистыми волосами. Его кожа и ногти были как у рептилии, его глаза сверкали прерывистым огнём звёзд. Он был одет в повседневные вещи без наименований и бирок. Шнурки ботинок завивались змеиными хвостами, просторная водолазка вмещала на себе два оранжевых солнца, поглощающих друг друга сплетением чёрной дыры, и джинсы на ногах переливались северным сиянием тёмно-синих тонов.",
        type: .common
    )
    
    private let text27n = PhraseData(
        text: "Каждый элемент поглощал внимание целиком, оторваться было просто нереально. Восстановленная память помогла сориентироваться – вне сомнений, это был демиург.",
        type: .common
    )
    
    private let text28n = PhraseData(
        text: "- ТЫ ЗЛОУПОТРЕБЛЯЛ ДОВЕРИЕМ ЛЮДЕЙ, ВОГРУЗИВ НА ЗНАМЁНА МОЁ ОТРАЖЕНИЕ. ТЫ ДАВАЛ ИМ ЛОЖНУЮ НАДЕЖДУ И ОТНИМАЛ ТОТ ХЛЕБ, ЧТО БЫЛ ИМ ПОСЛАН ЗА ТРУДЫ ИХ И ЧАЯНИЯ. ЗА ЭТО ПРИЖИЗНЕННО ТЫ БЫЛ НАКАЗАН, НО НА ЭТОМ ТВОЙ ПУТЬ НЕ ЗАКОНЧИЛСЯ.",
        type: .interlocutor
    )
    
    private let text29n = PhraseData(
        text: "ТЫ СТАЛ ВОПЛОЩЁННЫМ ВОЗМЕЗДИЕМ ДЛЯ ТАКИХ ЖЕ ЛЖЕЦОВ, КАК ТЫ САМ: ВСЁ ЭТИ ЛЮДИ, У КОТОРЫХ ТЫ ВОЛЕЙ СЛУЧАЯ УВОДИЛ НАКОПЛЕННОЕ, БЫЛИ ПАРАЗИТАМИ И КРОВОПИЙЦАМИ. ТВОЁ ШЕСТВИЕ ПО ГОЛОВАМ ПЛУТОВ И ОБМАНЩИКОВ НЕ ОТМЕНЯЕТ ТВОИХ ПРЕГРЕШЕНИЙ. ТЕБЕ ВЫПАДАЛИ ШАНСЫ ИСПРАВИТЬ СВОЁ ПОЛОЖЕНИЕ, ВЕДЬ К ТЕБЕ ОБРАЩАЛИСЬ ДОБРЫЕ ЛЮДИ В НУЖДЕ И НА СЛОМЕ. И СВОЙ ВЫБОР ТЫ СДЕЛАЛ. ПО ДЕЛАЕМ ТВОИМ ТЕБЕ И ВОЗДАСТСЯ.",
        type: .interlocutor
    )
    
    private let textPR = PhraseData(
        text: "Ты очнулся от опьянения, видишь застреленного незнакомца. От рулетки или от безысходности – неизвестно. Ты забираешь документы и начинаешь новую жизнь. На основе чего её строить – выбор за тобой. Денег и накоплений со старых документов при тебе больше нет, ведь всё пропалено конторой.",
        type: .common
    )
    
    private let textNR = PhraseData(
        text: "Ты очнулся от опьянения, и видишь незнакомца. Он предлагает тебе сыграть в рулетку... Хоть незнакомец и промахнулся, тебя задевает рикошетем. Снова амнезия, снова все по новой...",
        type: .common
    )
    var phrases: [PhraseData] {
        return [text0, text1, text2, text3, text4, text5, text6, text7, text8, text9, text10, text11, text12, text13, text14, text15, text16, text17, text18, text19, text20, text21, text22, textDD, text0n, text1n, text2n, text3n, text4n, text5n, text6n, text7n, text8n, text9n, text10n, text11n, text12n, text13n, text14n, text15n, text16n, text17n, text18n, text19n, text20n, text21n, text22n, text23n, text24n, text25n, text26n, text27n, text28n, text29n, textNR, textPR]
    }
    
//Варианты:
//1) Отказаться пить – ГГ играет на трезвую голову, нервничает; он берёт в руки револьвер, рука дрожит, он поднимает глаза на незнакомца и выстреливает в него, из-за мандража выстрел идёт мимо цели, незнакомец пробивает башку ГГ -> возврат обратно на стадию выбора пить или нет.
//2) Согласиться пить – ГГ может выпить пиво или абсент.
//Абсент:
//- Ты дурак что ли вовсе? Его нужно же было прожечь через сахар, да тем более с голодухи. Вот и ясно всё стало без русской рулетки… -> смерть от отравления, возврат к выбору алко.
//Пиво:
//- Отличный выбор, ты высосал целую кружку. Я не говорил тебе, что оно демидрольное?
//- Нееееет…
    

}
//
//
//struct FinalPositiveReference: PhraseDelegate {
//    static let shared = FinalPositiveReference()
//    private init() {}
//    
//    private let text0 = PhraseData(
//        text: "- Отличный выбор, ты высосал целую кружку. Я не говорил тебе, что оно демидрольное?",
//        type: .interlocutor
//    )
//    
//    private let text1 = PhraseData(
//        text: "- Нееееет…",
//        type: .mc
//    )
//    
//    private let text2 = PhraseData(
//        text: "Это был уже третий неестественный сон за сутки, башку ломило даже без сознания, а перед глазами мелькали образы всех последних месяцев, месяцев с тех пор, как ты терял память. Они выстроились в пёстрый калейдоскоп, который вращался и ломался до тех пор, пока картинка целиком не сложилась.",
//        type: .common
//    )
//    
//    private let text3 = PhraseData(
//        text: "Это был разговор с дьяком, то есть с его молодой версией, вы были на каких-то занятиях.",
//        type: .common
//    )
//    
//    private let text4 = PhraseData(
//        text: "- Значит, ты решил открыть свою секту?",
//        type: .sportsman
//    )
//    
//    private let text5 = PhraseData(
//        text: "- Не особо свою. Это будет русифицированный, упрощённый вариант кришнаитства. Тема популярна по всему миру, люди несут деньги для того, чтобы гуру научили их, как прийти к встрече с создателем после смерти. С точки зрения нас, это полная… щебень, но пипл хавает, мне плевать, почему, если честно. Как известно, мы живём в богом забытой, так что тут особый дефицит божественно – может клюнет кто на идею пообщаться с всевышним посмертно.",
//        type: .mc
//    )
//    
//    private let text6 = PhraseData(
//        text: "Это был разговор всё с ним же, но уже при иных обстоятельствах, в каком-то просторном зале.",
//        type: .common
//    )
//    
//    private let text7 = PhraseData(
//        text: "- Помнишь девушку, которая учила все сутры? Она перестала посещать твои сессии.",
//        type: .sportsman
//    )
//    
//    private let text8 = PhraseData(
//        text: "- Ничего страшного, людей мне хватает, а сборы уже начались.",
//        type: .mc
//    )
//    
//    private let text9 = PhraseData(
//        text: "- А на что тебе все эти деньги?",
//        type: .sportsman
//    )
//    
//    private let text10 = PhraseData(
//        text: "- Накоплю и свалю за бугор доживать в хороших условиях. А ни этого ли хотят все у нас?",
//        type: .mc
//    )
//    
//    private let text11 = PhraseData(
//        text: "После этого воспоминания всплыл образ незнакомца. Вы стояли напротив друг дурга, у него был прозрачный пакет документов.",
//        type: .common
//    )
//    
//    private let text12 = PhraseData(
//        text: "- Здесь всё, как и договаривались через сеть. Вижу, вы осуществили первый трансфер.",
//        type: .interlocutor
//    )
//    
//    private let text13 = PhraseData(
//        text: "- Да, всё верно. Могу я получить бумаги?",
//        type: .mc
//    )
//    
//    private let text14 = PhraseData(
//        text: "Он протянул пакет, ты бегло ознакомился.",
//        type: .common
//    )
//    
//    private let text15 = PhraseData(
//        text: "- Хорошо. Если честно, мне удалось собрать всё ещё даже раньше, чем запланировано. Я могу сейчас отправить вторую часть, вы тогда организуете оставшееся со своей стороны?",
//        type: .mc
//    )
//    
//    private let text16 = PhraseData(
//        text: "- Да, конечно, давайте…",
//        type: .interlocutor
//    )
//    
//    private let text17 = PhraseData(
//        text: "Ты полез в телефон, начал свайпать экран.",
//        type: .common
//    )
//    
//    private let text18 = PhraseData(
//        text: "- Всё готово.",
//        type: .mc
//    )
//    
//    private let text19 = PhraseData(
//        text: "- Вижу… Вижу, что бабла у тебя выше крыши, дружок.",
//        type: .interlocutor
//    )
//    
//    private let text20 = PhraseData(
//        text: "- Мы перешли на ты?",
//        type: .mc
//    )
//    
//    private let text21 = PhraseData(
//        text: "- Ты решил обчищать людей на такие суммы, ты, что думаешь, что это так можно? У нас все солидные люди верующие, они строят церкви по всей стране для людей для простых. Почему, как ты думаешь, мы такие дела проворачиваем и не попадаемся? Потому что бог с нами, мы богоугодны, мы ко всем честным людям относимся по-людски, а ты просто сосёшь из них деньги! Ты ведь не удивишься, что, после стольких динамо ходов тебя самого просто кинут?",
//        type: .interlocutor
//    )
//    
//    private let text22 = PhraseData(
//        text: "Из обратной стороны кожанки появилась короткая бита, и удар влетел ещё до того, как ты что-либо понял.",
//        type: .common
//    )
//    
//    private let text23 = PhraseData(
//        text: "Вот и всё, от химла в крови мозги встали на место – в прошлой жизни ты был гуру-кидалой, который хотел накопить на сытую жизнь за бугром в тепле. Ты почти достиг цели, но твой способ заработка сыграл против тебя.",
//        type: .common
//    )
//    
//    private let text24 = PhraseData(
//        text: "Не смотря на завершение просмотра воспоминаний, химной дурман по-прежнему не отпускал тебя. Это значило, что либо ты смотришь неприятный и долгий сон, либо… ты умер.",
//        type: .common
//    )
//    
//    private let text25 = PhraseData(
//        text: "Переулок, где был незнакомец, лишился домов, дорожных столбов, птиц в небесах. Ты стоял на асфальте, уходящим за горизонт, как неожиданный порыв ветра ударил в лицо. Он был таким сильным, что ты не мог держать глаза открытыми и не мог сделать вздох. Когда ветер стих, ты взглянул вперёд и увидел перед собой его.",
//        type: .common
//    )
//    
//    private let text26 = PhraseData(
//        text: "Это был высокий молодой человек с длинными волнистыми волосами. Его кожа и ногти были как у рептилии, его глаза сверкали прерывистым огнём звёзд. Он был одет в повседневные вещи без наименований и бирок. Шнурки ботинок завивались змеиными хвостами, просторная водолазка вмещала на себе два оранжевых солнца, поглощающих друг друга сплетением чёрной дыры, и джинсы на ногах переливались северным сиянием тёмно-синих тонов.",
//        type: .common
//    )
//    
//    private let text27 = PhraseData(
//        text: "Каждый элемент поглощал внимание целиком, оторваться было просто нереально. Восстановленная память помогла сориентироваться – вне сомнений, это был демиург.",
//        type: .common
//    )
//    
//    private let text28 = PhraseData(
//        text: "- ТЫ ЗЛОУПОТРЕБЛЯЛ ДОВЕРИЕМ ЛЮДЕЙ, ВОГРУЗИВ НА ЗНАМЁНА МОЁ ОТРАЖЕНИЕ. ТЫ ДАВАЛ ИМ ЛОЖНУЮ НАДЕЖДУ И ОТНИМАЛ ТОТ ХЛЕБ, ЧТО БЫЛ ИМ ПОСЛАН ЗА ТРУДЫ ИХ И ЧАЯНИЯ. ЗА ЭТО ПРИЖИЗНЕННО ТЫ БЫЛ НАКАЗАН, НО НА ЭТОМ ТВОЙ ПУТЬ НЕ ЗАКОНЧИЛСЯ.",
//        type: .interlocutor
//    )
//    
//    private let text29 = PhraseData(
//        text: "ТЫ СТАЛ ВОПЛОЩЁННЫМ ВОЗМЕЗДИЕМ ДЛЯ ТАКИХ ЖЕ ЛЖЕЦОВ, КАК ТЫ САМ: ВСЁ ЭТИ ЛЮДИ, У КОТОРЫХ ТЫ ВОЛЕЙ СЛУЧАЯ УВОДИЛ НАКОПЛЕННОЕ, БЫЛИ ПАРАЗИТАМИ И КРОВОПИЙЦАМИ. ТВОЁ ШЕСТВИЕ ПО ГОЛОВАМ ПЛУТОВ И ОБМАНЩИКОВ НЕ ОТМЕНЯЕТ ТВОИХ ПРЕГРЕШЕНИЙ. ТЕБЕ ВЫПАДАЛИ ШАНСЫ ИСПРАВИТЬ СВОЁ ПОЛОЖЕНИЕ, ВЕДЬ К ТЕБЕ ОБРАЩАЛИСЬ ДОБРЫЕ ЛЮДИ В НУЖДЕ И НА СЛОМЕ. И СВОЙ ВЫБОР ТЫ СДЕЛАЛ. ПО ДЕЛАЕМ ТВОИМ ТЕБЕ И ВОЗДАСТСЯ.",
//        type: .interlocutor
//    )
//    
//    let f = """
//    Далее варианты исходов.
//    При положительной карме герой может очнуться от опьянения, увидеть застреленного незнакомца. От рулетки или от безысходности – неизвестно. ГГ забирает документы и начинает новую жизнь. На основе чего её строить – выбор за ним. Денег и накоплений со старых документов при нём больше нет, ведь всё пропалено конторой.
//    При плохой карме герой просыпается от опьянения и видит незнакомца перед собой. Настаёт момент рулетки – герой играет и в зависимости от механики игры либо умирает, либо выживает. Далее ход переходит к незнакомцу, он тоже делает попытку выстрелить на основе высчитывания вероятности. И так, пока ГГ, либо незнакомец, не убьёт себя. Если незнакомец убивает себя, рикошет от стены задевает главного героя, он оказывается в начале игры с головной болью и амнезией.
//    """
//    
//    
//    var phrases: [PhraseData] {
//        return [text0, text1, text2, text3, text4, text5, text6, text7, text8, text9, text10, text11, text12, text13, text14, text15, text16, text17, text18, text19, text20, text21, text22, text23, text24, text25, text26, text27, text28, text29]
//    }
//}


//struct FinalReference: PhraseDelegate {
//    static let shared = FinalReference()
//    private init() {}
//    
//    private let text0 = PhraseData(
//        text: "Существует убеждение, которое гласит, что то, что должно случиться - должно случиться. С таким тезисом сложно спорить.",
//        type: .common
//    )
////    
////    private let text1 = PhraseData(
////        text: <#T##String#>,
////        type: <#T##PhraseType#>
////    )
////    
////    private let text2 = PhraseData(
////        text: <#T##String#>,
////        type: <#T##PhraseType#>
////    )
////    
////    private let text3 = PhraseData(
////        text: <#T##String#>,
////        type: <#T##PhraseType#>
////    )
////    
////    private let text4 = PhraseData(
////        text: <#T##String#>,
////        type: <#T##PhraseType#>
////    )
////    
////    private let text5 = PhraseData(
////        text: <#T##String#>,
////        type: <#T##PhraseType#>
////    )
////    
////    private let text6 = PhraseData(
////        text: <#T##String#>,
////        type: <#T##PhraseType#>
////    )
////    
////    private let text7 = PhraseData(
////        text: <#T##String#>,
////        type: <#T##PhraseType#>
////    )
////    
////    private let text8 = PhraseData(
////        text: <#T##String#>,
////        type: <#T##PhraseType#>
////    )
////    
////    private let text9 = PhraseData(
////        text: <#T##String#>,
////        type: <#T##PhraseType#>
////    )
//    
//    var phrases: [PhraseData] {
//        return []
//    }
//}
//
//let f = """
//Финал
//
//Тебя не спасла ни квартира, снятая без договора, ни одобренные маршруты для перемещений, ни случай, ни карма и не провидение, когда чёрный тканевый мешок опустился на твою голову. Спустя несколько перемещений и пиханий под рёбра мешок сняли – неожиданно, но ты был в борделе за городом, только в той его части, где могли оказаться только особые гости.
//Вокруг было несколько людей в погонах в потрёпанном виде. Все сидели вокруг большого стола: кто-то ел, кто-то пил, кто-то увлечённо касался нанятых девушек.
//Один сел через весь стол напротив, начал вести речь.
//- Ну ты маху дал однозначно, когда принял решение запускать деньги в акции крупных корпораций, пользуясь номерами, которые взяты под фальшивые документы. Если тебе продали симку, это ещё не значит, что всё шито-крыто. Мы теперь тут всё кроем и шьём для таких вот умельцев вроде тебя. Если честно, мне плевать, по каким сусекам ты скрёб, чтобы накопить эти суммы.
//Ты не кисни и не мрачней, в твоём деле не всё безнадёжно. Товарищ майор справедлив и совсем не жесток, так что он подготовил тебе способ выхода из грязных дел. Мы ведь выяснили, кто ты такой, а твои обвинения в вымогательстве уже истекли по сроку, так что ты можешь спокойно пересаживаться на старые документы, обычные, твои родные. Вот и они.
//
//Он достал изпод стола прозрачный запечатанный пакет с паспортом и несколькими другими бумагами.
//
//- Скажем так, мы окажем тебе услугу. Ты переоформишь, а точнее просто выдашь сведения по своим вкладам. Это всё перейдёт в наши руки, а взамен документы станут твоими. Все контакты шулеров ты нам тоже сливаешь, и вообще ты всех и всё сдаёшь с потрохами – про дела твои вокруг спорта мы тоже догадываемся. Или ты откажешься, пытать мы тебя не станем, документы ты не получишь, но зато тебе влепят за все прегрешения, связанные с использованием фальшивых бумаг. Что скажешь, друг? Выбор за тобой.
//
//Жарковато было сидеть в окружении этих пьяных лбов, хотя это могло быть и связано с чем-то ещё. Двери были закрыты, окна тоже. Пакет с паспортом лежал на столе. Переговорщик улыбался и молча смотрел на тебя.
//Одна из дверей отворилась, из неё одна за другой влетели стальные банки, выпускающие дымок. Пол секунды все смотрели на это, а ещё спустя мгновение ломанулись кто куда мог. Как бы кто ни дёргался, в итоге крепкий сон настиг каждого…
//
//- Посмотрите-ка, кто очнулся.
//Ты был всё на том же месте и в том же положении, что при разговоре с полицией. Самих полицейских не было нигде вокруг, на столе и полу виднелись редкие кровяные подтёки. В комнате находился только ты и незнакомец, который давил на тебя на переговорах, где ты был со спортсменом. Он был явно не в духе. Бутылки алкоголя были собраны в одну кучу, еда была нетронута. Незнакомец был вооружён серебристым револьвером с длинным дулом и ветвистой резьбой. По всей видимости, оружие было сделано на заказ.
//- Тебе объяснять нужно популярно, или сам всё поймёшь?
//-…
//- Мой контакт из их рядов сообщил, что ребята собираются раньше субботника, да ещё и с особым гостем. Эти парни въехали в тему по части работы с нелегальными документами. Им хотелось и насажать аферистов, и присвоить себе кучу денег. На деньги твои мне плевать, если честно, но вот первый пункт, это проблема… Они ведь не совсем идиоты - удалось им спалить цепочки, п которым я делал бумаги. Ты не первый, кто проплатил мне фальшак. Только ты не уехал из страны, как планировал, а остался и доигрался до акционных бумаг, сукин сын... У меня и раньше случалось, что ребята из низов правоохранительной системы находят спалившихся с документами и ищут источник, только это было всего один раз, и тогда уже мне пришлось зачищать ведущих расследование надмозгов. Было грязно, но я принял решение сразу же, и это мне окупилось – проблем не возникло, и всё вновь пошло своим чередом. Я рубил бабло на схемах, мои клиенты с бумагами сливались в другие страны каждый по своим причинам.
//Но тут появился ты. Эх и удалось же тебе не сдохнуть от удара битой по голове. Видать, ты особо живучий, или просто особо везучий, или же и то, и другое. Ну а я, видать, запорол себе карму, когда кинул тебя на бабло, вот теперь меня и выявили повторно.
//Я сейчас избавился от четырёх легавых умельцев, четырёх. Местные мадмуазель меня в лицо не видели, так что их закапывать смысла нет. А ещё мне дёргаться смысла нет, потому что всё, что я назвал, уже пущено в ход: ребята решили тебе похвастаться о том, что уже почти сделано. За мной точно явятся, вопрос лишь когда и что будет со мной – экстрадируют такого элемента откуда угодно.
//У меня ведь всё на мази было, всё на потоке, мне уже не интересно вспоминать молодость и каждый винтик этого процесса проворачивать своими руками. Но суть в том, что единственный способ для меня затеряться – применить вообще навыки, что у меня есть, один за другим и в одиночку. Это может быть и поможет, но я вот не уверен, что хуже, оказаться на нарах, или бегать по притонам Тайланда.
//Да, я, конечно, растратил свой фарт. Из-за тебя, или же вообще – в былые времена мне давалось всё куда легче.
//Так что вот как мы с тобой поступим. Раз у нас всё опять свелось к воле случая, и всё дело в везении, дай-ка я запущу проверку на оставшуюся удачливость прямо сразу, прямо сейчас. Мы сыграем с тобой в рулетку. Побеждаешь ты – ты берёшь документы и валишь на все четыре, все грехи повесят на мой труп, это точно. Побеждаю я – ты умираешь, ментов вешают временно на тебя, а мне это даёт фору.
//
//Ты смекнул, что, если играть откажешься, он в тебя просто выстрелит.
//- Я согласен.
//- Отлично, мать твою! Накати сперва, а то духу не хватит спустить курок. Я набрался уже дальше некуда, только стресс такой, что всё равно не пьянею.
//
//Варианты:
//1) Отказаться пить – ГГ играет на трезвую голову, нервничает; он берёт в руки револьвер, рука дрожит, он поднимает глаза на незнакомца и выстреливает в него, из-за мандража выстрел идёт мимо цели, незнакомец пробивает башку ГГ -> возврат обратно на стадию выбора пить или нет.
//2) Согласиться пить – ГГ может выпить пиво или абсент.
//Абсент:
//- Ты дурак что ли вовсе? Его нужно же было прожечь через сахар, да тем более с голодухи. Вот и ясно всё стало без русской рулетки… -> смерть от отравления, возврат к выбору алко.
//Пиво:
//- Отличный выбор, ты высосал целую кружку. Я не говорил тебе, что оно демидрольное?
//- Нееееет…
//Это был уже третий неестественный сон за сутки, башку ломило даже без сознания, а перед глазами мелькали образы всех последних месяцев, месяцев с тех пор, как ты терял память. Они выстроились в пёстрый калейдоскоп, который вращался и ломался до тех пор, пока картинка целиком не сложилась.
//Это был разговор с дьяком, то есть с его молодой версией, вы были на каких-то занятиях.
//- Значит, ты решил открыть свою секту?
//- Не особо свою. Это будет русифицированный, упрощённый вариант кришнаитства. Тема популярна по всему миру, люди несут деньги для того, чтобы гуру научили их, как прийти к встрече с создателем после смерти. С точки зрения нас, это полная… щебень, но пипл хавает, мне плевать, почему, если честно. Как известно, мы живём в богом забытой, так что тут особый дефицит божественно – может клюнет кто на идею пообщаться с всевышним посмертно.
//Это был разговор всё с ним же, но уже при иных обстоятельствах, в каком-то просторном зале.
//- Помнишь девушку, которая учила все сутры? Она перестала посещать твои сессии.
//- Ничего страшного, людей мне хватает, а сборы уже начались.
//- А на что тебе все эти деньги?
//- Накоплю и свалю за бугор доживать в хороших условиях. А ни этого ли хотят все у нас?
//После этого воспоминания всплыл образ незнакомца. Вы стояли напротив друг дурга, у него был прозрачный пакет документов.
//- Здесь всё, как и договаривались через сеть. Вижу, вы осуществили первый трансфер.
//- Да, всё верно. Могу я получить бумаги?
//Он протянул пакет, ты бегло ознакомился.
//- Хорошо. Если честно, мне удалось собрать всё ещё даже раньше, чем запланировано. Я могу сейчас отправить вторую часть, вы тогда организуете оставшееся со своей стороны?
//- Да, конечно, давайте…
//Ты полез в телефон, начал свайпать экран.
//- Всё готово.
//- Вижу… Вижу, что бабла у тебя выше крыши, дружок.
//- Мы перешли на ты?
//- Ты решил обчищать людей на такие суммы, ты, что думаешь, что это так можно? У нас все солидные люди верующие, они строят церкви по всей стране для людей для простых. Почему, как ты думаешь, мы такие дела проворачиваем и не попадаемся? Потому что бог с нами, мы богоугодны, мы ко всем честным людям относимся по-людски, а ты просто сосёшь из них деньги! Ты ведь не удивишься, что, после стольких динамо ходов тебя самого просто кинут?
//Из обратной стороны кожанки появилась короткая бита, и удар влетел ещё до того, как ты что-либо понял.
//Вот и всё, от химла в крови мозги встали на место – в прошлой жизни ты был гуру-кидалой, который хотел накопить на сытую жизнь за бугром в тепле. Ты почти достиг цели, но твой способ заработка сыграл против тебя.
//Не смотря на завершение просмотра воспоминаний, химной дурман по-прежнему не отпускал тебя. Это значило, что либо ты смотришь неприятный и долгий сон, либо… ты умер.
//Переулок, где был незнакомец, лишился домов, дорожных столбов, птиц в небесах. Ты стоял на асфальте, уходящим за горизонт, как неожиданный порыв ветра ударил в лицо. Он был таким сильным, что ты не мог держать глаза открытыми и не мог сделать вздох. Когда ветер стих, ты взглянул вперёд и увидел перед собой его.
//Это был высокий молодой человек с длинными волнистыми волосами. Его кожа и ногти были как у рептилии, его глаза сверкали прерывистым огнём звёзд. Он был одет в повседневные вещи без наименований и бирок. Шнурки ботинок завивались змеиными хвостами, просторная водолазка вмещала на себе два оранжевых солнца, поглощающих друг друга сплетением чёрной дыры, и джинсы на ногах переливались северным сиянием тёмно-синих тонов.
//Каждый элемент поглощал внимание целиком, оторваться было просто нереально. Восстановленная память помогла сориентироваться – вне сомнений, это был демиург.
//- ТЫ ЗЛОУПОТРЕБЛЯЛ ДОВЕРИЕМ ЛЮДЕЙ, ВОГРУЗИВ НА ЗНАМЁНА МОЁ ОТРАЖЕНИЕ. ТЫ ДАВАЛ ИМ ЛОЖНУЮ НАДЕЖДУ И ОТНИМАЛ ТОТ ХЛЕБ, ЧТО БЫЛ ИМ ПОСЛАН ЗА ТРУДЫ ИХ И ЧАЯНИЯ. ЗА ЭТО ПРИЖИЗНЕННО ТЫ БЫЛ НАКАЗАН, НО НА ЭТОМ ТВОЙ ПУТЬ НЕ ЗАКОНЧИЛСЯ. ТЫ СТАЛ ВОПЛОЩЁННЫМ ВОЗМЕЗДИЕМ ДЛЯ ТАКИХ ЖЕ ЛЖЕЦОВ, КАК ТЫ САМ: ВСЁ ЭТИ ЛЮДИ, У КОТОРЫХ ТЫ ВОЛЕЙ СЛУЧАЯ УВОДИЛ НАКОПЛЕННОЕ, БЫЛИ ПАРАЗИТАМИ И КРОВОПИЙЦАМИ. ТВОЁ ШЕСТВИЕ ПО ГОЛОВАМ ПЛУТОВ И ОБМАНЩИКОВ НЕ ОТМЕНЯЕТ ТВОИХ ПРЕГРЕШЕНИЙ. ТЕБЕ ВЫПАДАЛИ ШАНСЫ ИСПРАВИТЬ СВОЁ ПОЛОЖЕНИЕ, ВЕДЬ К ТЕБЕ ОБРАЩАЛИСЬ ДОБРЫЕ ЛЮДИ В НУЖДЕ И НА СЛОМЕ. И СВОЙ ВЫБОР ТЫ СДЕЛАЛ. ПО ДЕЛАЕМ ТВОИМ ТЕБЕ И ВОЗДАСТСЯ.
//
//Далее варианты исходов.
//При положительной карме герой может очнуться от опьянения, увидеть застреленного незнакомца. От рулетки или от безысходности – неизвестно. ГГ забирает документы и начинает новую жизнь. На основе чего её строить – выбор за ним. Денег и накоплений со старых документов при нём больше нет, ведь всё пропалено конторой.
//При плохой карме герой просыпается от опьянения и видит незнакомца перед собой. Настаёт момент рулетки – герой играет и в зависимости от механики игры либо умирает, либо выживает. Далее ход переходит к незнакомцу, он тоже делает попытку выстрелить на основе высчитывания вероятности. И так, пока ГГ, либо незнакомец, не убьёт себя. Если незнакомец убивает себя, рикошет от стены задевает главного героя, он оказывается в начале игры с головной болью и амнезией.
// 
//
//"""
